In [5]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows

In [4]:
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

Handling Missing Data

In [6]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado']) 
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
string_data.fillna('None')
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [10]:
string_data[0] = None 
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

Filtering Out Missing Data

In [11]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]]) 
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned = data.dropna() 
cleaned

     0    1    2
0  1.0  6.5  3.0

In [19]:
cleaned_method_all = data.dropna(axis = 1,how='all') 
cleaned_method_all

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
cleaned_method_any = data.dropna(axis=0,how='any') 
cleaned_method_any

     0    1    2
0  1.0  6.5  3.0

In [25]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -0.046058 -0.198717  0.766910
1 -1.255084  0.270980 -1.195107
2 -0.870719 -1.509720 -0.938244
3 -1.019667  0.025744 -0.143196
4  1.181832  1.489392 -1.074827
5  0.242184  1.003329 -1.452122
6  0.415415  0.912654  0.736537

In [32]:
df.iloc[:4, 1] = np.nan 
df.iloc[:2, 2] = np.nan
df

          0         1         2
0 -0.046058       NaN       NaN
1 -1.255084       NaN       NaN
2 -0.870719       NaN -0.938244
3 -1.019667       NaN -0.143196
4  1.181832  1.489392 -1.074827
5  0.242184  1.003329 -1.452122
6  0.415415  0.912654  0.736537

Filling In Missing Data

In [33]:
df_1 = df.fillna(0)
df_1

          0         1         2
0 -0.046058  0.000000  0.000000
1 -1.255084  0.000000  0.000000
2 -0.870719  0.000000 -0.938244
3 -1.019667  0.000000 -0.143196
4  1.181832  1.489392 -1.074827
5  0.242184  1.003329 -1.452122
6  0.415415  0.912654  0.736537

filling 2 in column 1 and 0.5 in column 2

In [34]:
df_2 = df.fillna({1: 2, 2: 0.5})
df_2

          0         1         2
0 -0.046058  2.000000  0.500000
1 -1.255084  2.000000  0.500000
2 -0.870719  2.000000 -0.938244
3 -1.019667  2.000000 -0.143196
4  1.181832  1.489392 -1.074827
5  0.242184  1.003329 -1.452122
6  0.415415  0.912654  0.736537

new data frame with new fill methods

In [35]:
data = pd.DataFrame(np.random.randn(6,3))
data

          0         1         2
0  1.472867  1.072753  1.168555
1  0.159241  0.071655  0.509392
2 -1.076603 -0.277491  1.410086
3 -0.735197  0.031458  0.774600
4  1.039981  0.892938  0.578794
5  0.008258  0.169810  1.051138

In [36]:
data.iloc[2:, 1] = NA
data

          0         1         2
0  1.472867  1.072753  1.168555
1  0.159241  0.071655  0.509392
2 -1.076603       NaN  1.410086
3 -0.735197       NaN  0.774600
4  1.039981       NaN  0.578794
5  0.008258       NaN  1.051138

In [37]:
data.iloc[4:, 2] = NA 
data

          0         1         2
0  1.472867  1.072753  1.168555
1  0.159241  0.071655  0.509392
2 -1.076603       NaN  1.410086
3 -0.735197       NaN  0.774600
4  1.039981       NaN       NaN
5  0.008258       NaN       NaN

In [38]:
data1 = data.fillna(method = 'ffill')
data1

          0         1         2
0  1.472867  1.072753  1.168555
1  0.159241  0.071655  0.509392
2 -1.076603  0.071655  1.410086
3 -0.735197  0.071655  0.774600
4  1.039981  0.071655  0.774600
5  0.008258  0.071655  0.774600

In [39]:
data2 = data.fillna(method = 'ffill', limit=2)
data2

          0         1         2
0  1.472867  1.072753  1.168555
1  0.159241  0.071655  0.509392
2 -1.076603  0.071655  1.410086
3 -0.735197  0.071655  0.774600
4  1.039981       NaN  0.774600
5  0.008258       NaN  0.774600

fillna with mean

In [41]:
new = pd.Series([3., NA, 3.5, NA, 7]) 
new =new.fillna(new.mean()) 
new

0    3.0
1    4.5
2    3.5
3    4.5
4    7.0
dtype: float64

Removing Duplicates

In [42]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]}) 
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [43]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [44]:
data1 = data.drop_duplicates()
data1

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [51]:
data1['v1'] = range(6) 
data2 = data1.drop_duplicates(['k1']) 
data2

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

    k1  k2  v1
0  one   1   0
1  two   1   1

In [52]:
data3 = data1.drop_duplicates(['k1','k2'], keep = 'last') 
data3

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

Transforming Data Using a Lambda Function

In [53]:
df = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]}) 
df

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [54]:
meat_to_animal = {  'bacon': 'pig',  'pulled pork': 'pig',  'pastrami': 'cow',  
                  'corned beef': 'cow',  'honey ham': 'pig',  'nova lox': 'salmon' }

In [57]:
df['food'] = df['food'].str.lower()
df['animal'] = df['food'].map(meat_to_animal)
df

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

using lambda

In [62]:
df['animal_lambda'] = df['food'].map(lambda x: meat_to_animal[x.lower()]) 
df

          food  ounces  animal animal_lambda
0        bacon     4.0     pig           pig
1  pulled pork     3.0     pig           pig
2        bacon    12.0     pig           pig
3     pastrami     6.0     cow           cow
4  corned beef     7.5     cow           cow
5        bacon     8.0     pig           pig
6     pastrami     3.0     cow           cow
7    honey ham     5.0     pig           pig
8     nova lox     6.0  salmon        salmon

Replacing Values inplace of missing values

In [63]:
data = pd.Series([1., -999., 2., -999., -1000., 3.]) 
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [66]:
data1 = data.replace(-999, np.nan)
data1

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [67]:
data2 = data.replace([-999, -1000], np.nan) 
data2

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [68]:
data3 = data.replace([-999, -1000], [np.nan,5]) 
data3

0    1.0
1    NaN
2    2.0
3    NaN
4    5.0
5    3.0
dtype: float64

or using dict

In [69]:
data4 = data.replace({-999: np.nan, -1000: 95}) 
data4

0     1.0
1     NaN
2     2.0
3     NaN
4    95.0
5     3.0
dtype: float64

Renaming Axis Indexes

In [92]:
df = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], 
                  columns=['one', 'two', 'three', 'four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [91]:
# taking the first 3 chars of each indices
transform = lambda x: x[:3].upper() 
df.index.map(transform)

Index(['OHI', 'COL', 'NEW'], dtype='object')

In [93]:
df.index = df.index.map(transform) 
df

     one  two  three  four
OHI    0    1      2     3
COL    4    5      6     7
NEW    8    9     10    11

Series.str.lower
Converts all characters to lowercase.

Series.str.upper
Converts all characters to uppercase.

Series.str.title
Converts first character of each word to uppercase and remaining to lowercase.

Series.str.capitalize
Converts first character to uppercase and remaining to lowercase.

Series.str.swapcase
Converts uppercase to lowercase and lowercase to uppercase.

Series.str.casefold
Removes all case distinctions in the string.

In [97]:
# syntax for renaming column: df = df.rename({'col1':'col_1','col2':'col_2'},axis='columns')
# or
df1 = df.rename(index=str.title, columns=str.upper) 
df1

     ONE  TWO  THREE  FOUR
Ohi    0    1      2     3
Col    4    5      6     7
New    8    9     10    11

In [99]:
df_1 = df1.rename(index={'OHI': 'NY'}, columns={'TWO': 'newnaame'}) 
df_1

     ONE  newnaame  THREE  FOUR
Ohi    0         1      2     3
Col    4         5      6     7
New    8         9     10    11

binning or bucketizing for continuous variables 
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.cut.html

In [100]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32] 
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins) 
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [101]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [102]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [103]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

rightbool, default True
Indicates whether bins includes the rightmost edge or not. If right == True (the default), then the bins [1, 2, 3, 4] indicate (1,2], (2,3], (3,4]. This argument is ignored when bins is an IntervalIndex.

In [108]:
cat_right_edge = pd.cut(ages, [18, 26, 36, 61, 100], right=False) 
cat_right_edge

[(18, 26], (18, 26], (18, 26], (26, 36], (18, 26], ..., (26, 36], (36, 61], (36, 61], (36, 61], (26, 36]]
Length: 12
Categories (4, interval[int64]): [(18, 26] < (26, 36] < (36, 61] < (61, 100]]

In [107]:
cat_right_edge.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [109]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior'] 
cat_labels = pd.cut(ages, bins, labels=group_names) 
cat_labels

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [110]:
data = np.random.rand(20) 
data

array([0.6918, 0.9816, 0.8647, 0.7723, 0.2537, 0.4758, 0.2911, 0.6763,
       0.8724, 0.1929, 0.5123, 0.2256, 0.6979, 0.7382, 0.2774, 0.5989,
       0.1279, 0.9691, 0.116 , 0.9678])

In [111]:
data_cut = pd.cut(data,4,precision=2)
data_cut

[(0.55, 0.77], (0.77, 0.98], (0.77, 0.98], (0.77, 0.98], (0.12, 0.33], ..., (0.55, 0.77], (0.12, 0.33], (0.77, 0.98], (0.12, 0.33], (0.77, 0.98]]
Length: 20
Categories (4, interval[float64]): [(0.12, 0.33] < (0.33, 0.55] < (0.55, 0.77] < (0.77, 0.98]]

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.qcut.html

In [112]:
data = np.random.randn(1000)  # Randn Normally distributed 
cats = pd.qcut(data, 4)  # Cut into quartiles 
cats

[(-0.041, 0.671], (-0.694, -0.041], (0.671, 3.087], (0.671, 3.087], (0.671, 3.087], ..., (-0.694, -0.041], (-0.041, 0.671], (-3.1479999999999997, -0.694], (-0.041, 0.671], (0.671, 3.087]]
Length: 1000
Categories (4, interval[float64]): [(-3.1479999999999997, -0.694] < (-0.694, -0.041] < (-0.041, 0.671] < (0.671, 3.087]]

In [114]:
pd.value_counts(cats)

(0.671, 3.087]                   250
(-0.041, 0.671]                  250
(-0.694, -0.041]                 250
(-3.1479999999999997, -0.694]    250
dtype: int64

In [115]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.041, 1.252], (-1.248, -0.041], (1.252, 3.087], (-0.041, 1.252], (-0.041, 1.252], ..., (-1.248, -0.041], (-0.041, 1.252], (-1.248, -0.041], (-0.041, 1.252], (-0.041, 1.252]]
Length: 1000
Categories (4, interval[float64]): [(-3.1479999999999997, -1.248] < (-1.248, -0.041] < (-0.041, 1.252] < (1.252, 3.087]]

filter out the outliers

In [117]:
df = pd.DataFrame(np.random.randn(1000,4))
df

            0         1         2         3
0    0.271348  0.831298  0.587731  1.699122
1   -0.419452 -0.172150 -1.780730 -0.251793
2    0.253211 -0.160328 -0.219606  0.275325
3    1.032819  0.227832  0.397857 -0.011512
4    0.414022 -1.250784 -0.641682  0.397885
..        ...       ...       ...       ...
995  0.589650  2.496850  1.071873 -0.349852
996 -0.997954  0.320797  0.867581  0.650584
997  0.327737 -0.921620 -0.889125 -0.570710
998 -0.100724  0.908396  0.015941 -1.436607
999 -1.029826 -0.165348 -0.869549 -1.612506

[1000 rows x 4 columns]

In [118]:
df.shape

(1000, 4)

In [119]:
df.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.013443     0.035455    -0.070159     0.005773
std       0.984855     0.982542     0.958880     0.993586
min      -3.704452    -2.844449    -2.898924    -3.067812
25%      -0.682583    -0.592296    -0.749384    -0.651402
50%       0.000673     0.038241    -0.072958     0.006437
75%       0.647246     0.668226     0.613502     0.669857
max       3.144224     2.995930     3.380074     3.260038

In [121]:
col = df[2]
col[np.abs(col)>3]

539    3.380074
Name: 2, dtype: float64

In [122]:
df[(np.abs(df) > 3)]

      0   1   2   3
0   NaN NaN NaN NaN
1   NaN NaN NaN NaN
2   NaN NaN NaN NaN
3   NaN NaN NaN NaN
4   NaN NaN NaN NaN
..   ..  ..  ..  ..
995 NaN NaN NaN NaN
996 NaN NaN NaN NaN
997 NaN NaN NaN NaN
998 NaN NaN NaN NaN
999 NaN NaN NaN NaN

[1000 rows x 4 columns]

In [123]:
df[(np.abs(df) > 3).any(1)] 
# 1 is the axis =1

            0         1         2         3
463  0.928562 -0.385669 -0.150108  3.177619
539 -1.269947 -0.084070  3.380074 -2.539282
541 -1.479088  0.257736 -0.388492  3.260038
589 -3.704452  0.552249  0.492659  0.202159
603  0.327316 -0.179766 -1.254668 -3.067812
894  3.144224  2.692691 -0.807392 -0.336689
924 -3.078477 -1.703541 -0.465037  0.969253

In [130]:
df[np.abs(df) > 3] = np.sign(df) * 3 
df.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.012805     0.035455    -0.070539     0.005403
std       0.981766     0.982542     0.957586     0.992007
min      -3.000000    -2.844449    -2.898924    -3.000000
25%      -0.682583    -0.592296    -0.749384    -0.651402
50%       0.000673     0.038241    -0.072958     0.006437
75%       0.647246     0.668226     0.613502     0.669857
max       3.000000     2.995930     3.000000     3.000000

In [131]:
np.sign(df).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1 -1.0 -1.0 -1.0 -1.0
2  1.0 -1.0 -1.0  1.0
3  1.0  1.0  1.0 -1.0
4  1.0 -1.0 -1.0  1.0

Reshaping - unstack

In [132]:
data = pd.Series(np.random.randn(9),index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],  
                                           [1, 2, 3, 1, 3, 1, 2, 2, 3]]) 
data

a  1   -0.191860
   2    2.105769
   3   -1.662918
b  1   -0.902269
   3   -1.000894
c  1   -0.005001
   2   -1.249526
d  2   -0.927136
   3   -2.007549
dtype: float64

In [133]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [134]:
data['b']

1   -0.902269
3   -1.000894
dtype: float64

In [135]:
data['b':'c']

b  1   -0.902269
   3   -1.000894
c  1   -0.005001
   2   -1.249526
dtype: float64

In [136]:
data.loc[['b', 'd']]

b  1   -0.902269
   3   -1.000894
d  2   -0.927136
   3   -2.007549
dtype: float64

In [137]:
data.loc[:, 2]

a    2.105769
c   -1.249526
d   -0.927136
dtype: float64

In [138]:
data.loc[:, 3]

a   -1.662918
b   -1.000894
d   -2.007549
dtype: float64

In [139]:
data.unstack()

          1         2         3
a -0.191860  2.105769 -1.662918
b -0.902269       NaN -1.000894
c -0.005001 -1.249526       NaN
d       NaN -0.927136 -2.007549

In [140]:
df_new = pd.DataFrame(np.arange(12).reshape((4, 3)), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']]) 
df_new

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [141]:
df_new.index.names = ['KEY1','KEY2']
df_new.columns.names = ['STATE', 'COLOR']
df_new

STATE      Ohio     Colorado
COLOR     Green Red    Green
KEY1 KEY2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [142]:
df_new['Ohio']

COLOR      Green  Red
KEY1 KEY2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [143]:
df_new['Colorado']

COLOR      Green
KEY1 KEY2
a    1         2
     2         5
b    1         8
     2        11

In [144]:
df_new.swaplevel('KEY1','KEY2')

STATE      Ohio     Colorado
COLOR     Green Red    Green
KEY2 KEY1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [145]:
df_new.sort_index(level=1)

STATE      Ohio     Colorado
COLOR     Green Red    Green
KEY1 KEY2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [146]:
df_new.swaplevel(0, 1).sort_index(level=0)

STATE      Ohio     Colorado
COLOR     Green Red    Green
KEY2 KEY1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [147]:
df_new.swaplevel(0, 1).sort_index(level=1)

STATE      Ohio     Colorado
COLOR     Green Red    Green
KEY2 KEY1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11